#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
//int main(){
//	//+ - * /  //
//	//除法
//	int a = 7 / 2;
//	printf("a=%d\n", a);
//
//	double b = 7.0 / 2;
//	printf("b=%lf\n", b);
//
//	int c = 7 % 2;
//	printf("c=%d", c);
//	return 0;
//}

//移位操作符   移动二进制位
//  >>  右移操作符
//【算数右移】  右边丢弃，左边补原符号位
//逻辑右移	右边丢弃，左边补0	


//  << 左移操作符
//左丢弃  右边补0
//内存中存储的都是补码
//二进制   原码  反码 补码
//正整数 原码 反码 补码 相同
//负整数 原码：直接写的二进制序列就是原码，符号位不变，按位取反就是反码，反码+1就是补码   
//int main(){
	//int a = 14;
	//00000000000000000000000000001110
	//int b = a >> 1;
	//00000000000000000000000000000111
	//printf("b=%d\n", b);

	//int c = -1;
	//原码 10000000000000000000000000000001
	//反码 11111111111111111111111111111110
	//补码 11111111111111111111111111111111
	//int d = c >> 1;
	//printf("%d", d);


	//vs采用算数右移

//	int a = 5;
//	//000000000000000000000000000000101  原 反 补
//	int b = a << 1;
//	//000000000000000000000000000001010
//	printf("%d", b);
//	return 0;
//}


//位操作符
//int main()
//{	
//	int a = 3;
//	//000000000000000000000000000000011 
//	int b = 5;
//	//000000000000000000000000000000101 
//	//int c = a&b;//       &按二进制位位与
//	//000000000000000000000000000000001
//
//	//int c = a | b;  //按二进制位或
//	//a 000000000000000000000000000000011
//	//b 000000000000000000000000000000101 
//	//  000000000000000000000000000000111
//
//	int c = a^b;  //按位异或  相同为0  相异为1
//	//a 000000000000000000000000000000011
//	//b 000000000000000000000000000000101 
//	//  000000000000000000000000000000110
//	printf("c=%d", c);
//	return 0;
//}


//int main()
//{
//	int a = 3;
//	int b = 5;
	//a 000000000000000000000000000000011
	//b 000000000000000000000000000000101 
	//a b交换
	//a = a^b;
	//  000000000000000000000000000000110
	//b = a^b;
	//  000000000000000000000000000000011
	//a = a^b;
	//  0000000000000000000000000000000101
//	return 0;
//}


//int main(){
//	int num = 0;
//	
//	num += 10; ////num = num + 10;
//	num >= 1;//num>> 1;
//
//	return 0;
//}

//int main()
//{
//	//2 + 3;// + 有两个操作数 - 双目操作符
//	//int a = 3;
//	//printf("%d\n", !a);
//
//	int flag = 0;
//	if (flag=0)
//	{
//		//flag为真进
//	}
//	if (!flag)
//	{
//		//flag为假进
//	}
//	return 0;
//}

//int main(){
//	int a = 10;
//	&a;  //  &取地址操作符 
//	printf("%p\n" ,&a);
//	int*pa = &a;  //pa是指针变量
//	*pa=20;   // *解引用操作符
//	printf("a=%d\n", a);
//	return 0;
//}


//int main()
//{	
//	//sizeof 计算变量所占空间大小
//
//	int a = 0;
//	int arr[10] = {0};
//	printf("%d\n", sizeof(a));
//	printf("%d\n", sizeof(int));
//
//	printf("%d\n", sizeof(arr));  //计算数组总大小  单位字节
//	return 0;
//}

//int main()
//{
//	int a = 13;
//	//00000000000000000000000000001101
//	//00000000000000000000000000010000           1<<4
//	a=a | (1 << 4);
//	printf("%d\n", a);
//	a &= (~(1 << 4));
//	printf("%d\n", a);
//	return 0;
//}


//int main()
//{
//	int a = 10;
//	//int b = a++;      //先使用 后++，   
//	int b = ++a;         //先++ 后使用
//	printf("a=%d  b=%d\n", a, b);
//	return 0;
//}


//int main()
//{
//	int a =(int) 3.14;  //强制类型转换
//	return 0;
//}

//int main()
//{	
//	int a = 3;
//	int b = 5;
//	int c=a&&b;
//	printf("%d\n", c);
//	return 0;
//}


//int main(){
//	int a = 10;
//	int b = 20;
//	int c = a > b ? a : b;
//	printf("%d\n", c);
//	return 0;
//}


//int main()
//{
//	//从左向右依次执行
//	int a = 1;
//	int b = 2;
//	int c = (a > b, a = a + b, a, b = a + 1);//13
//	return 0;
//}

//int main()
//{
//	int arr[] = { 1, 2, 3, 4, 5, 6 };
//	printf("%d\n", arr[3]);//下标
//	return 0;
//}


//#include<string.h>
//struct stu
//{
//	char name[20];
//	int age;
//	char tele[12];
//	char sex[5];
//};
////结构体成员.变量
////结构体指针->变量
//int main()
//{
//	struct stu s = {"sz",20,"13072957461","男"};
//	struct stu* ps = &s;
//	printf("%s\n", ps->name);
//	printf("%s\n", ps->age);
//	return 0;
//}



//表达式求值
int main()
{
	//整型提升
	char a = 3;//阶段
	//00000000000000000000000000000011
	//00000011   a
	char b = 127;
	//00000000000000000000000001111111
	//01111111 b
	char c = a + b;
	//00000000000000000000000000000011   a
	//00000000000000000000000001111111   b     整型提升
	//00000000000000000000000010000010
	//10000010      c
	//整型提升  
	//11111111111111111111111110000010--补码
	//11111111111111111111111110000001
	//00000000000000000000000001111110   -126
	printf("%d\n", c);
	return 0;
}